<template>
    <v-container fluid class="bg-teal flex-grow-1 container ">
      <v-card class="bg-blue-grey-darken-2 card">
        <div class="main">
            <h1>Проект на Vue.js - Кинотеатр</h1>
            <div class="">
                <h2>Описание:</h2>
                <p>Привет! Я рад представить вам свой проект - онлайн-кинотеатр, разработанный с использованием фреймворка Vue.js. В этом проекте я использовал несколько ключевых технологий и инструментов, чтобы создать мощное и интерактивное веб-приложение.</p>
            </div>
            <h2>Технологии и инструменты:</h2>
            <v-expansion-panels variant="inset" class="my-4">
                <v-expansion-panel
                    title="Vuetify"
                    text="Для удобной и эффективной разработки пользовательского интерфейса я воспользовался библиотекой Vuetify. Она предоставляет множество компонентов и инструментов, которые значительно упрощают создание стильных и адаптивных пользовательских интерфейсов."
                ></v-expansion-panel>
                <v-expansion-panel
                    title="Pinia"
                    text="Для управления состоянием приложения я использовал библиотеку Pinia. Она предоставляет простой и эффективный способ организации и обмена данными между компонентами, обеспечивая плавную и реактивную работу приложения."
                ></v-expansion-panel>
                <v-expansion-panel
                    title="VueRouter"
                    text="Для управления маршрутизацией в приложении я использовал Vue Router. Это позволило мне определить различные маршруты и связать их с соответствующими компонентами, создавая плавную навигацию и переходы между страницами."
                ></v-expansion-panel>
                <v-expansion-panel
                    title="Vite"
                    text="Vite - это инструмент сборки и разработки для проектов на Vue.js (и не только). Он предлагает быструю разработку и горячую перезагрузку (hot module replacement) во время разработки, что значительно ускоряет процесс разработки."
                ></v-expansion-panel>
                
            </v-expansion-panels>

            <h2>Цели и задачи:</h2>
            <ul style="padding: 20px;">
                <li>
                    Моя главная цель при создании этого проекта была предоставить пользователям удобный и интерактивный способ наслаждаться фильмами. Пользователи могут искать фильмы по жанрам, просматривать информацию о фильмах, читать отзывы и даже бронировать билеты на сеансы прямо через приложение.

                </li>    
                <li>
                    Кроме того, я уделил особое внимание пользовательскому опыту, создавая плавные анимации, отзывчивый и адаптивный дизайн, а также удобные элементы управления.
                </li> 
                <li>
                    Закрепил знания использования Vue (Composition API), Pinia , Vuetify (с использованием удобных компонентов и инструментов), Vue Router (для плавной навигации) и использовал LocalStorage, чтобы получать из него фильмы, добавленные в закладки.
                </li>
                <li>
                    Я наслаждался каждым шагом разработки этого проекта на Vue.js, и надеюсь, что пользователи также оценят его функциональность и эстетику. Буду рад ответить на ваши вопросы и услышать ваше мнение о проекте!
                </li>                                                                                                    
            </ul>

            <v-btn @click="watchClick">Смотреть</v-btn>
        </div>
      </v-card>
      
                
    </v-container>
</template>

<script setup>
    import { useRouter } from 'vue-router';

    const router = useRouter();
    function watchClick(){
        router.push('/all');
    }
</script>

<style scoped>
    .container {
        height: 95.13vh;
        display: flex;
        align-items: center;
        flex-direction: column;
    }

    .card{
        width: 500px;
        margin: 20px;
    }
    .main{
        padding: 20px;
        
    }
</style>